import re
import unicodedata

# jōyō kanji:            2,136
# jinmeiyō kanji:          863
# kanji kentei (kanken): 6,355

sets = {
    'JOYO':         '亜哀愛挨悪握圧扱宛安暗案闇以位依偉囲委威尉意慰易椅為畏異移維緯胃萎衣違遺医井域育一壱逸稲茨芋印咽員因姻引飲淫院陰隠韻右宇羽雨臼渦唄浦運雲餌営影映栄永泳英衛詠鋭液疫益駅悦謁越閲円園宴延怨援沿演炎煙猿縁艶遠鉛塩汚凹央奥往応押旺横欧殴王翁黄岡沖億屋憶臆乙俺卸恩温穏音下化仮何価佳加可夏嫁家寡科暇果架歌河火禍稼箇花苛荷華菓課貨過蚊我牙画芽賀雅餓介会解回塊壊快怪悔懐戒拐改械海灰界皆絵開階貝劾外害崖慨概涯蓋街該骸垣柿嚇各拡格核殻獲確穫覚角較郭閣隔革学岳楽額顎掛潟割喝括活渇滑葛褐轄且株釜鎌刈瓦乾冠寒刊勘勧巻喚堪完官寛干幹患感慣憾換敢棺款歓汗漢環甘監看管簡緩缶肝艦観貫還鑑間閑関陥韓館丸含岸玩眼岩頑顔願企伎危喜器基奇寄岐希幾忌揮机旗既期棋棄機帰気汽畿祈季紀規記貴起軌輝飢騎鬼亀偽儀宜戯技擬欺犠疑義議菊吉喫詰却客脚虐逆丘久休及吸宮弓急救朽求泣球究窮級糾給旧牛去居巨拒拠挙虚許距漁魚享京供競共凶協叫境峡強恐恭挟教橋況狂狭矯胸脅興郷鏡響驚仰凝暁業局曲極玉僅勤均巾錦斤琴禁筋緊菌襟謹近金吟銀九句区苦駆駒具愚虞空偶遇隅串屈掘窟靴熊繰桑勲君薫訓群軍郡係傾刑兄啓型契形径恵慶憩掲携敬景渓稽系経継茎蛍計詣警軽鶏芸迎鯨劇撃激隙桁傑欠決潔穴結血月件倹健兼券剣圏堅嫌建憲懸拳検権犬献研絹県肩見謙賢軒遣鍵険顕験元原厳幻弦減源玄現舷言限個古呼固孤己庫弧戸故枯湖股虎誇雇顧鼓五互午呉娯後御悟碁語誤護乞交侯候光公功効勾厚口向后喉坑好孔孝工巧幸広康恒慌抗拘控攻更校梗構江洪港溝甲皇硬稿紅絞綱耕考肯航荒行衡講貢購郊酵鉱鋼降項香高剛号合拷豪克刻告国穀酷黒獄腰骨込頃今困墾婚恨懇昆根混痕紺魂佐唆左差査沙砂詐鎖座挫債催再最塞妻宰彩才採栽歳済災采砕祭斎細菜裁載際剤在材罪財坂阪咲崎埼作削搾昨柵策索錯桜冊刷察拶撮擦札殺雑皿三傘参山惨散桟産算蚕賛酸斬暫残仕伺使刺司史嗣四士始姉姿子市師志思指支施旨枝止死氏祉私糸紙紫肢脂至視詞詩試誌諮資賜雌飼歯事似侍児字寺慈持時次滋治璽磁示耳自辞鹿式識軸七執失嫉室湿漆疾質実芝舎写射捨赦斜煮社者謝車遮蛇邪借尺爵酌釈若寂弱主取守手朱殊狩珠種腫趣酒首儒受呪寿授樹需囚収周宗就州修愁拾秀秋終習臭舟衆襲蹴週酬集醜住充十従柔汁渋獣縦重銃叔宿淑祝縮粛塾熟出術述俊春瞬准循旬殉準潤盾純巡遵順処初所暑庶緒署書諸助叙女序徐除傷償勝匠升召商唱奨宵将小少尚床彰承抄招掌昇昭晶松沼消渉焼焦照症省硝礁祥称章笑粧紹肖衝訟証詔詳象賞鐘障上丈乗冗剰城場壌嬢常情条浄状畳蒸譲醸錠嘱飾拭植殖織職色触食辱尻伸信侵唇娠寝審心慎振新森浸深申真神紳臣芯薪親診身辛進針震人仁刃尋甚尽腎迅陣須酢図吹垂帥推水炊睡粋衰遂酔随髄崇数枢据杉裾澄寸世瀬畝是凄制勢姓征性成政整星晴正清牲生盛精聖声製西誠誓請逝醒青静斉税隻席惜戚斥昔析石積籍績脊責赤跡切拙接摂折設窃節説雪絶舌仙先千占宣専川戦扇栓泉浅洗染潜煎旋線繊羨腺船薦詮践選遷銭鮮前善漸然全禅繕膳塑措曽狙疎礎祖租粗素組訴阻遡僧創双倉喪壮奏爽層想捜掃挿操早曹巣槽燥争痩相窓総草荘葬藻装走送遭霜騒像増憎臓蔵贈造促側則即息捉束測足速俗属賊族続卒袖存孫尊損村遜他多太汰唾堕妥惰打駄体堆対耐帯待怠態戴替泰滞胎袋貸退逮隊代台大第題滝卓宅択拓沢濯託濁諾但達奪脱棚谷誰丹単嘆担探旦淡炭短端綻胆誕鍛団壇弾断暖段男談値知地恥池痴稚置致遅築畜竹蓄逐秩窒茶嫡着中仲宙忠抽昼柱注虫衷酎鋳駐著貯丁兆帳庁弔張彫徴懲挑朝潮町眺聴腸調超跳長頂鳥勅捗直朕沈珍賃鎮陳津墜椎追痛通塚漬潰坪爪釣鶴亭低停偵貞呈堤定帝底庭廷弟抵提程締艇訂諦逓邸泥摘敵滴的笛適溺哲徹撤迭鉄典天展店添貼転点伝殿田電吐塗妬徒斗渡登賭途都努度土奴怒倒党冬凍刀唐塔島悼投搭東桃棟盗湯灯当痘等答筒糖統到藤討謄豆踏逃透陶頭騰闘働動同堂導憧洞瞳童胴道銅峠匿得徳特督篤毒独読栃凸突届屯豚頓曇鈍奈那内謎鍋縄南軟難二尼弐匂肉虹日乳入如尿任妊忍認寧猫熱年念捻燃粘悩濃納能脳農把覇波派破婆罵馬俳廃拝排敗杯背肺輩配倍培媒梅買売賠陪伯博拍泊白舶薄迫漠爆縛麦箱箸肌畑八鉢発髪伐罰抜閥伴判半反帆搬斑板氾汎版犯班畔繁般藩販範煩頒飯晩番盤蛮卑否妃彼悲扉批披比泌疲皮碑秘罷肥被費避非飛備尾微眉美鼻匹膝肘必筆姫媛百俵標氷漂票表評描病秒苗品浜貧賓頻敏瓶不付夫婦富布府怖扶敷普浮父符腐膚譜負賦赴阜附侮武舞部封風伏副復幅服福腹複覆払沸仏物分噴墳憤奮粉紛雰文聞丙併兵塀幣平弊柄並蔽閉陛米壁癖別蔑偏変片編辺返遍便勉弁保舗捕歩補穂募墓慕暮母簿倣俸包報奉宝峰崩抱放方法泡砲縫胞芳蜂褒訪豊邦飽乏亡傍剖坊妨帽忘忙房暴望某棒冒紡肪膨謀貌貿防北僕墨撲朴牧睦勃没堀奔本翻凡盆摩磨魔麻埋妹昧枚毎幕膜枕又抹末繭万慢満漫味未魅岬密蜜脈妙民眠務夢無矛霧婿娘冥名命明盟迷銘鳴滅免綿面麺模茂妄毛猛盲網耗木黙目餅戻問紋門冶夜野弥矢厄役約薬訳躍柳愉油癒諭輸唯優勇友幽悠憂有湧猶由裕誘遊郵雄融夕予余与誉預幼妖容庸揚揺擁曜様洋溶用窯羊葉要謡踊陽養抑欲沃浴翌翼羅裸来頼雷絡落酪乱卵嵐欄濫藍覧利吏履梨理璃痢裏里離陸律率立略流留硫粒隆竜侶慮旅虜了僚両寮料涼猟療瞭糧良量陵領力緑倫厘林臨輪隣瑠塁涙累類令例冷励礼鈴隷零霊麗齢暦歴列劣烈裂廉恋練連錬呂炉賂路露労廊弄朗楼浪漏老郎六麓録論和話賄脇惑枠湾腕丼傲刹哺喩嗅嘲毀彙恣惧慄憬拉摯曖楷鬱璧瘍箋籠緻羞訃諧貪踪辣錮塡頰叱剝',
    'JINMEIYO':     '籾節練繁署者臭著視謁謹賓贈逸難響娃阿逢葵茜渥旭葦芦梓斡絢綾鮎或粟庵按鞍杏伊夷惟謂亥郁磯溢鰯允胤蔭烏迂卯鵜窺丑碓姥厩瓜閏噂云叡曳瑛榎堰奄燕苑薗於甥襖荻桶牡伽嘉珂禾茄蝦嘩迦霞俄峨臥駕廻恢魁晦芥蟹凱鎧浬馨笠樫梶恰叶椛樺鞄兜蒲鴨茅萱粥侃柑竿莞巌雁嬉毅稀徽祇誼掬鞠桔橘砧杵汲灸笈鋸亨匡卿喬蕎饗尭桐欣欽禽芹衿玖矩駈喰寓櫛釧屑沓窪隈栗鍬袈祁圭慧桂戟訣倦喧捲牽硯絃諺乎糊袴胡跨伍吾梧檎瑚醐鯉倖宏巷庚弘昂晃杭浩紘腔膏閤鴻劫壕轟忽惚此昏些叉嵯瑳裟坐哉犀砦冴堺榊肴鷺朔窄笹薩皐錆晒撒燦珊纂讃仔孜斯獅爾而蒔汐竺雫悉篠偲柴縞紗勺灼錫惹洲蒐輯峻竣舜駿楯淳醇曙渚恕哨嘗庄捷昌梢樟湘菖蕉裳鞘丞杖穣埴燭晋榛秦壬訊諏厨逗翠錐錘瑞嵩雛菅頗雀摺棲栖蹟碩尖撰穿銑閃噌曾楚疏蘇叢宋惣槍漕綜聡蒼其揃舵楕陀苔黛鯛醍鷹瀧啄托琢茸凧只辰巽竪辿樽坦歎湛耽檀弛智馳筑註猪喋寵帖暢牒脹蝶槌槻佃柘辻蔦綴椿紬悌挺梯汀禎蹄鄭釘鼎擢纏兎堵杜砥套宕嶋燈祷董撞萄鳶寅酉惇敦沌遁凪薙灘捺楢馴楠汝賑廿濡禰祢乃之埜巴播杷琶芭盃煤這秤萩柏箔曝莫函肇筈幡畠鳩塙隼挽磐蕃庇斐緋樋枇毘琵柊疋彦菱畢桧紐彪瓢豹廟彬瀕冨斧芙撫葡蕪楓葺蕗淵吻焚頁碧瞥篇娩鞭圃甫輔戊菩峯捧朋萌蓬鋒鳳鵬卜殆幌哩槙柾鱒亦俣沫迄麿蔓巳箕湊蓑稔牟椋姪孟蒙儲勿尤貰匁也耶靖佑宥柚祐邑輿傭楊耀蓉遥淀螺洛蘭李裡掠劉溜琉龍亮凌梁稜諒遼淋琳鱗麟伶嶺怜玲憐漣煉簾蓮魯櫓狼禄肋倭鷲亙亘詫藁蕨椀碗乘亞佛侑來俐傳僞價儉兒凉凛凰剩劍勁勳卷單嚴圈國圓團壞壘壯壽奎奧奬孃實寢將專峽崚巖巫已帶廣廳彈彌彗從徠恆惡惠惺愼應懷戰戲拔拜拂搜搖攝收敍昊昴晏晄晝晨晟暉曉檜栞條梛椰榮樂樣橙檢櫂櫻盜毬氣洸洵淨渾滉漱滯澁澪濕煌燒燎燿爭爲狹默獸珈珀琥瑶疊皓盡眞眸碎祕祿禪禮稟稻穗穰穹笙粹絆綺綸縣縱纖羚翔飜聽脩臟與苺茉莊莉菫萠萬蕾藏藝藥衞裝覽詢諄謠讓賣赳轉迪逞醉釀釉鎭鑄陷險雜靜頌顯颯騷驍驗髮鷄麒黎齊堯槇遙凜熙俠摑擊焰瘦禱繡繫萊蔣蠟醬顚鷗俱卽吞增寬巢徵德揭晚曆橫步歷每涉淚渴溫瀨狀簞綠緖緣薰虛蟬賴郞錄鍊黃黑欄廊朗虜類猪神祥福諸都侮僧勉勤卑嘆器墨層悔憎懲敏暑梅海渚漢煮琢碑社祉祈祐祖祝禍禎穀突',
    'KANKEN_10':    '人一見出気大手上目女子中日生本力入下先立二口王小年男十音学足名白三空山月水正早木金田千天文車土石校耳青赤花火五四右休夕七林左村玉犬百虫字六貝森町八草川雨竹糸九円',
    'KANKEN_09':    '言思何分前間今自時行方来心話体合当後顔少知聞理声場会同長通地考回家食作外切強明国用引頭直近内色高教止数道元父多楽歩書光帰首風線親門刀室兄夜母番馬新走答黒万形姉半店遠点広友交記活海電鳴組語公野肉台画原計太朝社売細読寺茶買里矢米園才古工戸角市紙牛丸図妹弱星船東毎北雪夏昼鳥西弓羽冬歌弟毛京絵晴春週黄科午南魚谷算秋雲岩曜麦池汽',
    'KANKEN_08':    '事様者感動部持意度物全取身向実葉味面世悪使相対所死屋君真神着開返界待仕落問発重決指受表定終代主始次反勝化命族息配起他流想美安放調員苦由題消丁乗集業助進血守追転予両負打急深去運平服具幸期申都係第有礼皮飲横送品役速階軽式宮悲暗和客談路病注練遊根院投住習局商育薬祭昔島等宿温級陽整球波短研酒羊旅銀鼻館庭号写究鉄曲豆登医箱列歯荷勉区板央氷庫皿寒秒湯油福委章駅拾緑倍坂橋植童柱筆詩洋泳農州湖暑港岸帳畑県漢昭炭笛',
    'KANKEN_07':    '無笑的戦最不変達付然以好結良法夫続覚要信愛必別初連飛残関機置失成伝軍果単特願周説兵加差望完約未隊器利選料満仲側冷共静念街熱議位官徒城束泣民験辺察令案試散景治昨種参害求包量観席類衣焼勇鹿帯固争極折各低例香底司産欠建材敗照井末改働印老労飯希積氏協輪鏡管佐借功課順陸群英浴菜奈健挙訓辞節録努灯清便倉候芸養給児臣崎祝標府唱兆栄省副卒札博貨械浅松季競孫富康典塩岡旗縄億徳梨巣票熊賀梅芽牧漁沖刷径岐阪郡茨媛埼滋阜潟栃',
    'KANKEN_06':    '情可確性士解能現張殺応状過得在絶術態支報断素精構囲識備告師寄限常再件程任格険勢余経団際夢破許似居質示義制護移武眼容迷務判保像故接興証技逆暴謝喜復非増領衛準犯効象罪防史混布比導救設久快減職責属慣個造型圧雑液弁独演価提基留査句資適仮堂境修毒志政授因率条妻総織舎額規禁検燃製略桜統評複則貸測祖営歴易婦費永招編損停厚河粉財採築賞脈豊賛枝益旧績講災貧紀飼述墓幹酸航潔仏往版序鉱輸均税貯銅綿刊肥耕貿',
    'KANKEN_05':    '私視呼姿我背貴存認敵優痛胸段座供異舌欲装探難訳危傷警寸聖降片裏困腹忘激吸並論乱割閉若疑処射収巻至退穴捨密届己将映簡染派済刻筋秘従納窓皇除値否亡系権暮脳幼骨頂純操泉厳紅補担枚洗層干盛宝訪樹展敬宙誤砂模臓遺討陛策乳棒承孝域推郷奮蔵宇専机晩揮宅障宣預幕劇縮尊延善垂源奏詞看針諸裁忠宗衆灰創律就恩誕誠冊革翌仁勤卵縦暖熟盟臨拝尺誌拡覧鋼閣班潮党署沿胃蒸庁銭著糖磁朗株肺券批腸絹賃憲后郵俳穀俵蚕',
    'KANKEN_04':    '彼込違撃振突離丈剣倒瞬抜逃浮頼輩抱押腕触普攻鬼殿寝恐髪奴隠驚怒怖微皆渡奥御肩端婚影響黙弾握況介腰壁娘吐壊惑震恋途恥為舞闘叫獣襲駆眠与妙遅甘隣巨踏疲憶越刺絡奇詰更吹冒避薄払替郎歳互脱迎敷捕涙距爆騒到麗輝抗尋幾跡尽床繰被荒慢描沈陣迫含傾拠威扱陰遣屈耐悩継盗柔及柄援儀依汚狂跳珍執尾召縁寂占凶慮監即鋭杯仰戒汗露旨詳透傍致巡飾煙兼砲暇玄忙抵盾侵雄是沢雷称恵匹般脚療秀坊誇躍歓紹丘狩載菓泊祈霧翼紫範狭添趣環偉濃烈塔拍乾鮮溶豪淡踊猛凡隷咲雅摘齢獲慎嘆徴噴鎖唐罰腐鈍矛訴彩漫維戯浜掘劣鼓盤惨紋却鑑釈幅畳敏澄浸舟僧朱粒煮繁芝斜帽勧滴濁網堅伺贈項誉較販桃征剤胴扇曇稿峰枯茂軒膚沼箇稲蓄脂俗需燥緯姓拓丹圏鉛舗芋盆刈殖暦搬朽恒欄薪雌旬堤壱肪峠賦謡弐',
    'KANKEN_03':    '魔騎掛甲霊怪帝揺又伸嬢邪滅姫炎超誘慌奪辛崩緊悟了締華悔吉衝既漏裂伏吏廊焦勘携封袋斤刑冗覆換潜房魂埋如硬貫殴穏虚撮幻賊喚施抑随憎択滑双憂匠愚緩獄膨掃契擦聴魅脅昇酔縛瀬嫁哀偶遭零絞孤企斗賢審恨侍鍛乙裸控塗凍遇揚殊謀晶伐漂癖免惜請紛塊譲促粋棄凝遂削掲隻卑幽犠牲憩肝奉拘錬赦催雇掌伴徐苗概敢粘卓排壇隔胆穂没錯忌卸虐潤慰寿託飽翻励阻婆滞辱喫詠葬湿軌膜慈豚鎮巧宴募鐘縫駐疾畜怠胞架佳乏符籍粗浪啓藩綱彫妨棋暫芳陶顧炉欺逮滝帆錠哲糧悦冠繕穫礎某慕猟衰邦赴摂慨抽墜孔菊鶏郭斥稚炊諾蛮隆軸搾匿湾紺婿髄墨窒欧擁楼胎克訂簿餓尿倣廉陳郊娯岳該閲篤陵弧鯨措碑坑桑債峡酵畔泌濫鋳墳祉遵墾陪痘倹嘱厘諮',
    'KANKEN_PRE_2': '僕戻緒嫌麻駄頑爵竜扉唇亜銃刃猫眺忍肌裕艦捜雰懐伯酷充臭褒索妃懸偽逸砕挑挟稼唯江侯拒渉蛇斉肖隅壮寧堪靴涼癒誓羅偵厄棚泥寮且症釣把徹悠鈴呈据遮還肢叔廷督洞尉廃陥渋津患愉診弔瓶磨筒汁妄邸償撤渦珠睡肯痴核析泡履挿酬昆旋漠購傘浄棟尚憤融琴缶擬献醜紡沸囚貞猿疎殻拐濯甚侮喪僚窮漆宰拙亭妊斎粧枠披覇恭剛荘垣曹頻渇屯襟耗暁庶偏堕摩繊艇蛍懇顕軟塾倫薫呉柳禍閥紳剰銘涯奔飢鉢秩謙妥枢塚宜浦煩括漬拷宵杉娠詐謁仙併虜崇弦貢粛懲寛硝薦吟諭俊抹慶喝岬弊塀傑姻茎棺堀搭槽撲閑菌謹培淑衡媒逐賜韻帥嚇奨尼盲賓享猶疫朴溝升轄譜蚊泰凹藻騰迅践醸遍勲褐惰祥逝翁糾嫡幣酌庸賄繭循愁准栽剖禅唆塁渓彰霜累勅酢碁栓叙附洪矯凸寡桟遷漸但嗣賠窃殉憾窯悼扶壌硫訟礁朕舶坪罷痢璽衷租俸儒劾畝詔迭酪丙虞款謄抄頒逓塑',
    'KANKEN_02':    '俺誰頃旦瞳闇呪狙凄頬尻呂斬眉拳諦潰匂膝妖椅隙那爪蹴挨拶喉鍵巾拭牙脇藤塞沙謎宛璧籠湧股苛僅顎剥賭亀唾捉憧袖蓋貌妬虎弄骸叱痕嵐羨嘲貼枕窟艶鬱璃嫉鍋昧弥捻淫裾稽瓦餌嗅詮刹醒曖曽蜜勃駒罵汰須爽蔑肘崖冥瑠鎌采畏蜂乞箸溺臆串戴餅鶴戚藍冶怨虹腫貪羞臼傲睦芯綻葛痩頓慄侶遜咽柵桁萎椎玩蔽丼挫瞭膳踪摯喩唄拉麺遡斑辣惧釜填梗錦煎麓緻詣捗箋舷韓柿伎腺汎旺瘍勾脊賂腎酎彙憬堆氾哺沃畿毀恣諧訃楷錮',
    'KANKEN_PRE_1': '禾嬉叩云勿卜彦戊頁廿也呆撫勺嘘亦艮乍掴覗訊噂溜繋貰龍巴槍辰濡揃狼溢歪怯噛喋呑乃乎酉馴伊鎧杖筈纏喧妾這釆舛喰其辿坐叶惚昏卿壬掻圭嘩蒼堵蓮之雫智巽爺葵或窺蘇斐尖狐紗此傭捧讐而閃鞄牢塵轟咳悶晒綾遥吊楓庇隼砦凪莫阿杏憐疋翠瑞兎殆肋逢鱗蜘梓胡橘賑茜鷹撒紐亥厨斧霞薙煽朋蝶鞭惹仇釘萌吾些迂雛槌屍廻馳湊雀甫鞘詫昂掠吠寅髭冴獅苑烏玲稀柊噌穿瞥鳳燐柚椿儲亮桐蘭汐尤辻淵碧鳩凌汝瓜洩牽篠狽恰飴錆焚竿兜蕩昌哉栖燈栗灼渚汲裟袈朔沌棲垢厭鷲酋葱狗脆套沫只腿螺娼唖淀桶伽繍糞猪燭捌鼠忽卯劫薩耶駕巳榊豹捲躯祐蝕亘綴聡樽桂柏緋跨楚蔓腔諜篭蟻杭鞠弗叉仔秤屑芹皐狸檎姐餐煉摺瀕醤於舵郁峯梢笠寵琢牡蝋巷洲喬焔蔭梯嶋幡孟宥庵毅襖笹杜厩夷慧湛嘉碗幌漕蔦駿藁蛙隈輿讃耽萩鞍愈弛曾磐蹟姦謂嶺禄挽樫窪旭弘吋葡桔掬柴萄梁苔鵜屠蟹淋膏洛妓挺暢鴨贋俄董庄燦叡燕駈浩輔戟蒔粥姪丞櫛迦魁姑佑坦蒲禿剃李袴粟允玖怜甥窄蕎癌楯叛惣佃裡鹸靭吻榛蒙鷺菱煤堰捷哨伍澱鍔閏楠茸播鋒硯椛曳雁琉磯錐漣禽嘗瑛蹄樋椀倦蝉錫轍芦恕盃匙簾遼丑壕曝顛糊麟晦噺鯉汀鮫諒裳鮎諏祷縞珊悉倖瑚嚢扮臥櫓蝦樵醍醐撰凱篇粕廟芙膿函蚤菩榎鯛陀柑嵩芥鱈巌蓉箔鮭稜絢涜檀琶琵敦槻狛茅秦荊絃涛靖鰻蛾肴紬鳶筑樺瀧穣壷梶湘笥吃斡鴻蒐鍬黛楊牝蓑宏擢牌訣叢赫迄楕僻蛸箪淳埠倶誹鋸荻胤斯劉葦毘逗蓬疹柘淘誼祇侭遁惟蝿轡嬰纂葎竪楢諌菅托帖戎鍾綜杓宋兇碍牟竺騨茄駁鑓邑魯鄭饗鉾爾杵鯖侠撹砥諺晋啄趨碇梱菖犀徽醇鴎灸蛭鰹錨椋瓢凧亨峻鏑鰐筏捺廓逼鋲閤濠舜鵠註慾曙鵬柾溌坤涌謬偲畠麹尭廠馨按熔錘鰭倭峨俣晃蕉歎葺卦芭鐙摸嵯脹烹寓鈎鴇婁鵡灘娩蕗漉痔衿竃頚桧聾笈掩埜糠樟銚姥肱耀箕槙庚麿畢梧蕃牒蛤賎圃蕪恢匡鼎碩橿箭薯鋤沓薮韮擾鉦籾欝矩畦釦蛋撞奄凋萱鰯蕨莞緬什埴冨鱒莱虻聯渠砧禦苫鮒鴛欣黍夙鐸塙荏頗鎗桓袷匁紘綬禰珪菰鍍弼碓罫欽竣甜鮪劃藷撚舘匪堺桝疏蒜鯵釧渥翰稔彬伶鎚侃杷杢瀞稗僑薗庖糎蒋潅鴫屡浬斌禎宍糟栂穎苅醗銑粁哩枇鈷悌輯苧琳菟蕊碕珂亙栴翫鋪蔀噸畷穆椙鰍粂鴬粍姶箆蛎澗棉岨橡甑揖櫨樗矧榔盈楳宕孜嬬猷肇椴頴蔚彪岱砺惇苓瑳祢梼彊簸塘佼匝祁栢詑咋廼娃硲穐砿柁瀦迩',
    'KANKEN_01':    '丿儿气亅厶丶彳頷乂广厂戌戈弋幺夂彡亠呟勹尸昜冂夭甬綺宀韋囗豕睨隹冖匕歹尹廾癶几攵夬殳兀冫舐聿帚卩膣凵咼囁匈从揉騙躊躇眩訝髟俯愕毋罠巫于唸滲凛痺辟莉憑嗟呻咄薇攣薔奢穢屮匚翔蛛儂竦拗戉絆冏皺瞼踵珀喘佇彑蟲痙佰琥軋禹咎瞑埃澪咆贅廴峙遙亢淹礫顰蠢曼抉櫂哮翡竟咥闊眷殲煌虍檻朧嵌茉贄縋彷壺曰躱旡絨攫洒冑爰眸腑嗜躙毯瘴炸渾媚跪爛嗚蹂颯徨嬌櫻尢擲旁囮祓儚巛儘孕嗤咒猥凜墟疼躰迸昴啜棘痒縣蜥蜴菫癪躾逡茫卆扁禺埒彭枷夾謳涎忝祟靄恍戮吼靡芻逞國炒貶筧詛襞它翳橙豈獰瞠朦箒憫澤栞條滓狡仄咀嚼揶揄掟燻痣矜睫棍疇甦噤榴憚傀儡焉齧藪撥蹲祠轢隕聶祀熾碌咢呵捩暈蝠蝙濤苺贔杞屓鉤鴉壽凰咤茹稟飄孰珈琲褪悍裔肛冤捏篝癇鋏頸朶梳憮蜀屁遽崔徊斃徘炙嘔蕾豸悸滾癸賽宦侘鉈譚噪嬲亶猾鬲懺哄饒饅窘鵺贖螢翅齒蠅漲拮參刎諫膠髏髑僭悴膂莪馮嶽蠍囃謐彿哭屹彗憔滸帛孵褄攪氣躓芒沁棗弩毟蓼聳娶脛猊痍嗇瞰賤筐泄餃罹睥椒雉邂逅慟簪僥搦眇瞞蠱懃慇縷詭袂麒啖爬魄楔呷毬爻耒蜃驕奧鑽磔嘴矮惠諍潘戍誅泪窩虔攘柩烙梟嘯鶯臀藉齎餉夥竈晰僉拵鏃憊屏燎靱姜齟齬臍鼬鯱訛腱跋銛輌恫藝腋竄穹囓咬劒簒罅誑鼡涸啼扈貘簀卉莢邁匣袁餡悧蛆魎瘤塹樂詈疵桿嚥闖站勒餞嗄蝗睾謗猩敝魏鄙皓乖鬨矍凭眦邏闌咫奸佩柬鑢韭炬酊酩蠕猜亞訥灌耆閨瑕爿閻漿燼饉艘衾滔抓囀揆燵荼魍懊嘶洸寥瀉做檜麾悄愴膵舳瞿擽鏖閂盧櫃胥匆澹紆帷狒黎焙綽藹欒撼檄蜻頽蛉螂肚禊怱蟷傅瑤懣羹誂黴雍籐漱斛洟鹵匍蠣鬣瀟髯鳰萬玻雹剌噎奠厠喊鍮襦撓剋蚩輛沽鬚磋肆眈卍盡婉拌渕霹靂愾隘倅蟇膀胱剪獪忸怩鐵吝鑿袱盥仗刮甕襤褸袢濾覿劈眞偃魑訶崑邯鄲崙濘愧棹憺蝮兪瑣辜銜蛹茗蘆截壜槇鞋褻吽駝薊繚蛟檸檬盪鑼蟠瀑梃區椰殷沱滂躅躑舅鸚駱躁忖旱髷霆筵籤耄蜩譫冽浚鍼恃驢幟聊虱棕炮縺餮饕瘡箍鵞褥緞臂濛棠發縊兌隧蟄櫚闢坩堝來皙娑箏臙艱襷箝嬪榜孺聘燗瀾慚誦釉炯疚掏橇瑶葫斟會頤斂脾熏叟吶鼾俟梵痰笏剽儺已閾谺馭麩跫單瑜數浣槃涅毫寨堡鉗衒睿輜袍筍鬘趙譬婢幇喇戔囂鸞叭匐韜麝蝸濱嫂欅槐瑪瑙鵲罐霰敲饐兔奕顫鬩惡魘蚓蚯羆蕁枳儕喀獺颶絽謔磊沐攀瞋嫣倆歇狄窶緘疱拿綯鉋寇框腥袞鮨杳擂牆堯驀蹙穽縒胚襾諳懦籃廣恙骰寞踝楡驟篩蘊胛縹犇諤獏刳慥軛恬黽俎趾蓙氈艫逍撻晨褌罌貂淆鴦鎬畸拇秣无鑷篁懼凉踞坎狢歿蕭芍聚嶮輻茣鶫鑠址曷蝎蜷伜鼈笊臑搗龕鞴崋覺恚顏糺繻怙帙熨嗾瓏檣抒枡從舂瓊羔盒蛞蝓邀疸鬢錚圓槿昵瀝扼樅仆飜綸脣陋茲抛俥擡鰓潭繞烟鏝搏呶讒紮羌舫劍佗漑擱蹌貉聲闍垓與塒號觜拱踉廏鈿軻疽蒻麭蒟掣皹弑齊髴髣繃聟膾襄絣嫋赭肅愍柢辷瘠鮑鱧埓薺釵瘧莵俤皴渺廬圀繹廂崗羂曠寐佞鱸馥諷覯艤鴒鶺顆徠徂慊覡馗誨騏忿煖幔鯰羚幀襴悋鰌慙鞣冰裃莨蚣蜈跛圖魃艷濶箴筺雖楪筅諱笙挾砒溯蹈悖宸艪頌旒羈嶼侈泛諄跣鬥篷个杠葭應黝谿髻癩睛蔡薨鰊蒡嶌溂鏤鑚媼將弖莚薀蝟椚襯逵佻厖腟專椥稠轉羯蓆艀諂潁笞旌譴懶饌甍繙娥嫦當慳盂樒蹠燧簑霙瀚侑臘鞆蟀篦壹籬鉞隋狷跏痾烽舁梏賁鰤筮滿筥疳桎癲鶉芬娜婀鱶癬坏臈莽闕槓蜚鰺蟆杙蟋遑鰆衍纈翦稍煥艾躪狆讚藺柝墺臾閊窿尠醂恤轆轤悛嚆悽縅糀礙佛顳婪耻騾橈燠趺慷犂諛牀迢扨饑笄苞枉砌倪覘舩誣豺猖獗兒迹俘涵飩紊梔饂馘游櫟怺篆諚蹶處晟擒欹螻鳧澳丕擅窖惻彌鎹絲齋椽蜆喃鬆礒焜霍喙嗔渣杼蜊蛯蜿僂鑵楮蟒邊嚮靨謨貳楞偈諡閘蜒瘢爨颱倨粢茱萸罎嬶倚駭瞽粽腓胝毳啀轅彎鵑疝溥纐疣冢痞偸慂慫蹉跌叮嚀殄沮稈剔佶榧閭對酣餘尨棧鵯礬韃稷巍擧渤蹊侏痼冲咸覲欖橄狎靼熄傴鯏嗽皎鈞瑯琺茴糜蛻衙颪賺啻鋩稙薹翹礦錣鱠團脩輾庠曉鰈楝梠捐榕麥涕勁輳讓懈汕纓鑞鱚蜉蝣阡暹鐺糯膊厥學鈔弉蛄閇邇盞榮腮壟奘惶胄攴瘋胼瑾澎鞜襠岫噫靠篥篳鷂萼纔鹹祚躬恟驍爲淮檗冀碾褓襁熙衢雋屎麁儼黐囈豁犢戀箙誡艙鯊萃裲瘻嘸媾荀沛眄筝瑟湮丱粮炳缺膺滄鐚兢戛禧凩纒霽鴈霖袿怏湃躄簇瓩殱渫惘僵齣壼鰡緇浙顋豌坡迚楫檳寔鏨謫鷭咏妍欷歔翩紲鑰攬蕈瓔餠駘陌闡纜癡苹漓訌鶸蹇俚珞幄假邃姆殯堊奚鮠冕嫩蟾蘚磧眥謦赧菲鞏壻莟氓巖冉疥胯揣蝨蘗寶苟岑靜綏耘遉滌痲褞茘鯔臺鮓磬贓菴廚銷霏桙綛暉跼嫗悚齷齪銕溲實聰甞汞舸苣萵鷸醴顴呱飫蔬榾撈淙酥禪掉籟湍俑梛偕卅恆淪鬮甃駸裘珎鷽黥舍簗婬萍紂鰥仞蔕髮煕跚蹣熹櫺鶲寳檮骼猴媽蘂祿碼叺鮟糒肓變晏峽妁佝蠑鴿隗筬弍鵙嚔霓筌軫裄辨畚鱇蓐繽繩廐茵嘖鯣烝撩辯疆蘿孑詁闥髀鍜椨璋巓鵄觴齦闃柞喨醺鴆蘖衞舒輦崛佚輓粱豎髱鷓槲鴣晧體澁晁煬篏瀰蹕莓艸嚊鵝瑰栲嚏愎駑蛔晝礪樸梭慴鈕滬顱苒錏詢冪檐峪鞅鬧仭銓杆醵倩鐶蜑挌觚蚋弭蔟疊汪磚枸邱柯褶逕鮹殪駻祗哇驥鏘頡凾爼殃醪桴笋軈箚椹齲鑁癆鸛硼菠膈騅螫鴟硅癘哥阮羮轂犒鷦鷯髢巵驛泗剱簫暎蒿拈戞儁湫笨蟯簓辮鞦騫苜蓿疔誄籖薐奎萠喞烱斫讖鰰籌墻藐耨鮃皰譎飮溪懷栩耿韆擯楸蜍燔鐔椈搶俐鶇艟艨抔糶淺啣甸菁讎摧羸癈鰒靫弯閔悵葯怫螟贐羃關窕窈鎔恪霄莎瓣薑脉粳牴鯡乘范陝厦掖惺碣癰縟籔赳鄰偖菘皀僣皸潸鏈綮蔗寃蕷旆秕珮謖孚蹤醋蚌釐痂膩瓠褫扠轌杣裙淇幢嬋癧瘰螯姨鑛榻譏鉅罔鰮靉鶩貽娵鞨麪綵藕靆徭榑嘛噬晤棊澆瘁溷蔔燹芟轗歸遲滉羲窗夛鋺枋恂簔陬藜廩吭醢駮剄貮鼕黶惷曩霑蕋悒濺蓴剿袗螳箜篌藏禮覽懿簷豬鐐緲綟貅隨插瀋瑁洵樊鈑膃肭贏黯裹挂弌佯裨鰕翕袤繖玳鐫橢蹼喟枹蠎證寫邉灣怡罩絅仍牘筰甌茯麸緡鯒罨簽嚠羇磑渊稻賈隴娟溟錺鑒遏葷丐虧闔輒訐孀麋蚪蝌哈恁傚祺閼鬻蝴蠡檍朮潺諢篶錻絋氛釿倔覬脯覦堙笳嶇豼丗拜鉉姙覊蘋躋塋菎薤謚荵磽衄頏縲膕蚫樣隱輕帶價藥燿廈黔笘礑嶄鰾黠簣聢嬖煢荳苳倥冦偬儻譟鞐掾渭劔臧驪迯估蓊驩湲駟薈糢粃蚰蓚鴃錢總勞歐愼瞻韶峭蠶槨縉蒹燬瓮价憖鶚峩絛垤纛夊骭閖龜汾篋陞軾渟璞穰鯤淦蠧熕囑櫪擘勦唳簧輊綢羝蛩讀觀騷嚴穗嵜踰麼秉竭鑄雕胖葩鵤嵬螽儔銹觝葆陜尅絖魴呰殤蒄菽簟霾縡貔溽讌剴腴絏鞳芫胙櫞遖紕鴕蓖糂楾蠏沒邨灑臚兮隍椏蚶臠繝繧匏懾帑袵阨粡傳獨辭黌姚埔迪瑩裴鄒攷寤悳壑岷杲靺狠皋痳儷愿慵冱癢岌夘飭甎牾餝衽伉抃蓁樛穡鵆氤餾曚權忰雙巒殼勳昶沾們粲徙陟渙矗瀛僮塢繆絮桷黜麈鴾鏗椶擠逶巉扞瘟褊蓍蕣釟柮餬麕衵逑蛬鯑餤經賣戰兩殘卷點續囘畫寢譯爭斷雜默亂驗拔濟靈黨繪豫燒圍聽稱釋醫舊醉據豐觸旛鷄淨屬收驅狹拂裝磅鬪鹽搖樓繼戲惱祕盜壞歡僞壓爐險孃陷營譽莊竝廢攝顯獸彈册跟洙檢壯獻搜粹慘屆刄擔效怎齡擴腦勸膽碎穩塲睹徑矣勵呀并驤謠薛昊邵鎭珸縱很謌雎旻臟晉滯贊徃敍竊淞潛濕怕駛擇廖瞶翊决竇犧鐡獵墮歟廳圈潴踐逹皷蠻琅沂攸呎釀网吩穉粤燮毆槎鰲熈渝曄漾甄僊葢隲壥啾莖劬苻敖孩洽匯妲杁咐鄂驃卞敞覓况髓霸趁絳垰籏杰轎鶻彝罕棣旃銖卻愬找潼駢慍晢皈壘壤暸梦忻奬綫眤冐蔘皖誥畤霎濬泯衲滕懋劭崕唔楙淤嶷听扎儉畄聨刪尓瀘膓犁毓袒妣峅崚隸濮扣咯迴釼琿嶝桀洌肄湎俛淌訖吁纖僖噐閙猗郢檠樔岔剩晄墅勣獎樞縢埣咨泓莇哂奐慓拯劵遐罘羣垪禀搆陂濂曵稾潯暘踴舖倏覩熬輅磴輙怛垠瞹贇劑緝郤荅饋鎰淒匱寰恠拆仂衫紜勗擣凖捫萇潦迥恊懴孱覃曁賚綰臻臉棡皚剳嫖愃蠹歙曦煦亟倬鐃郛抂俶韈娚膸擺枦拊袰嶂售孛舉珥縻遶翆妝輟亳盖圜圉縵栫齶萢仟榲哦覈唹畧澂跖髦摶狃盻荐眛忱倡汨遯躡憙嫻懌阯囹壙遞搓閧圄鑾纎亰鷙蕚苡酘瀏貊岻涓痿蹐槁湟筱垈挈抖徇瓷囿餒泝槭陲槊囎遒圻枩歛嚶扛竅圷槧忤鬟杪抬淅痊軼韵敕鮗懽廸矚攅竢彜拏絎旄孥暄侖侫厮朸秬捍夸鷏莠甼盍鬯戡鑪哽廨殞詒襪莅蠖閹槹誚韲枌啗轣壅蘰惆秧濳籀聒徼搨迺廡贍畊糅袙耜葮擶踟嗹瀲逾冩謾薜貲蒂夐隰档啌暾萋澑糴綉澀紵嵎睚嗷洶襍錵蒭愨籘罸苴褂乕叨唏彖瀁鮴楹愆蟶豢慝陦沍萓衂奩嵋禳晞飆餽俔枴惴耙幗鞫洳澣釁匸搴詬圦麑鼇厰醯箟笵娉燉緜弃揀鯢嶢朏孳澡猯黏鏐譌辧掎逖瞎貍爍帋浹跂苙惓腆俾蝪掀幤乢逋廁缸碪鷁寉罟謇勍騁竒驫嫺梺耋讙龠懍嬾碆墫憇溘髫幃黻屐軆廛矼吮踈鴪睇嶐髞笆羶譁鰔嫐紿敘崢捶橦詆偐牋垳烋酲暝埀瓲隶釶畆愀猝鯀驂刋匳滷菻碚檪剞纉鏥钁剏泅嶬殫詼溏粭聆亊攤杤歉椁昃襃飃廰黼欸犖耡廝錙鞁淕攜龝幵怦湶珱蘢諠刧悃鉚挧笶朖轜矇榁鵐妛愡鳬瘉彁撕嵒痃繿鰉糲桾犹竸昿殀罍釛麌歃洫黹賍綣鉐畴殍蘯柤癜茆蕘籥蕀櫁酳揩枅袮靹孅劼遘鈩哢摎朞梍賻岾罧舮鯲泙瓰沚刔楜襌笂柧畛淬疉蘓釡埖懆槞畭鰄鳫夲廱酖愽甓軣榿畋樮緤黷椪皃簍茖躔橲泱碯裼靦榠閠蕕譖戳槫逧霈瓱鰛朿霤鯆鷆壗貎疂餔哘崟繦遨鍠咾塰墹窰菷葹逎椡犲跿竕粫筴拑卮棯椣渮碵鐇馼褝啝岼峇戝掵椌堽嵶暼禝齠掫梹艚凅桍榱纃齔欟畩萪觧啅悁殕聹赱鶤硴秡竰粨藾鈬怐柎浤甅籵糘鮖崘砠竓貭輹鍄勠埆弸旙棆橸濆濔瓧瓸竍竏竚竡譛陏霪鱆恷斈椢椦沺畉艢蟐軅釖鍖鵁齏冓圸坿墸岶嵳幎暃朷楴槝櫑璢磆礇穃膰艝蔆譱靤駲垉堋屶慯抻棔樌汢稘粐膤襭諞鐓鵈儖峺悗慱柆椄樢樶汳畍癨箘緕肬'
}

def sorted__ord_list(s):
    list = [ord(c) for c in s]
    list.sort() # in-place
    return list

def binary_search(l, x):
    if len(l) < 2:
        if l[0] == x: return True
        else:         return False
    mid = len(l) // 2
    if x < l[mid]: return binary_search(l[:mid], x)
    else:          return binary_search(l[mid:], x)


lookups = { k: sorted__ord_list(v) for k, v in sets.items() }

# small kana variants (捨て仮名 - sutegata)
sutegata = [
        # hiragana
        '\u3041\u3043\u3045\u3047\u3049', # ぁ, ぃ, ぅ, ぇ, ぉ
        '\u3063',                         # っ
        '\u3083\u3085\u3087',             # ゃ, ゅ, ょ
        '\u308E',                         # ゎ
        '\u3095\u3096',                   # ゕ, ゖ
        # katakana
        '\u30A1\u30A3\u30A5\u30A7\u30A9', # ァ, ィ, ゥ, ェ, ォ
        '\u30C3',                         # ッ
        '\u30E3\u30E5\u30E7',             # ャ, ュ, ョ
        '\u30EE',                         # ヮ
        '\u30F5\u30F6'                    # ヵ, ヶ
    ]

# TODO: SYMBOL
non_kanji = {
    'HIRAGANA':   lambda c: bool(re.match(r'^[\u3040-\u309F]+$', c)),
    'KATAKANA':   lambda c: bool(re.match(r'^[\u30A0-\u30FF]+$', c)),
    'DAKUTEN':    lambda c: '\u3099' in unicodedata.normalize('NFD', c),         # kana with 濁点 (dakuten - ゛)
    'HANDAKUTEN': lambda c: '\u309a' in unicodedata.normalize('NFD', c),         # kana with 半濁点 (handakuten - ゜)
    'SUTEGATA':   lambda c: bool(re.match(rf'^[{''.join(sutegata)}]+$', c)),
    'OBSOLETE':   lambda c: bool(re.match(r'^[\u3090\u3091\u30F0\u30F1]+$', c)), # ゐ, ゑ, ヰ and ヱ
    'KANJI':      lambda c: bool(re.match(r'^[\u4E00-\u9FFF]+$', c)),
    'DIGIT':      lambda c: bool(re.match(r'^[0-9\uFF10-\uFF19]+$', c)),
    'ROMAJI':     lambda c: bool(re.match(r'^[a-zA-Z\uFF21-\uFF3A]+$', c)),

    # hiragana: ゛ (dakuten), ゜ (handakuten), ゝ (kurikaeshi)
    # katakana: ・ (nakaguro), ヽ (katakana gaeshi)
    'OTHER':      lambda c: bool(re.match(r'^[\u309B\u309C\u309D\u30FB\u30FD\u30FE]+$', c))
}

def groups_from_ord(n):
    result = []
    for c, l in lookups.items():
        if binary_search(l, n):
            result.append(c)

    # add general 'KANKEN' if 'KANKEN_x'
    for c in result:
        if c.startswith('KANKEN_'):
            result.append('KANKEN')
            break

    return result

def groups_from_chr(literal):
    result = []
    for c, p in non_kanji.items():
        if p(literal):
            result.append(c)
    return result

def groups(literal: String):
    return groups_from_chr(literal) + groups_from_ord(ord(literal))
